Tekla Open API Reference for Tekla Structures 2025
Operation.CalculatePourUnits Method
 Calculate and assign objects to pour unit Model object types that are associated with pour unit are assembly types except cast in situ, reinforcements of different kind, components and screws
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CalculatePourUnits()
Public Shared Function CalculatePourUnits As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace